Revit 2027 API
BuiltInFailures.MEPCalculationFailures.AtLeastOneEquipmentOnDuty Property
 There should be at least one equipment on duty.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId AtLeastOneEquipmentOnDuty { get; }
Public Shared ReadOnly Property AtLeastOneEquipmentOnDuty As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ AtLeastOneEquipmentOnDuty {
	FailureDefinitionId^ get ();
}
static member AtLeastOneEquipmentOnDuty : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPCalculationFailures Class
Autodesk.Revit.DB Namespace